In [265]:
import pandas as pd

In [266]:
df = pd.read_csv(r"C:\Users\hb292\Downloads\titanic.csv")

In [267]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [268]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [269]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [270]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [271]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [272]:
data = df[['Pclass', 'Sex', 'Age', 'SibSp', 'Fare']]

In [273]:
data

     Pclass     Sex   Age  SibSp     Fare
0         3    male  22.0      1   7.2500
1         1  female  38.0      1  71.2833
2         3  female  26.0      0   7.9250
3         1  female  35.0      1  53.1000
4         3    male  35.0      0   8.0500
..      ...     ...   ...    ...      ...
886       2    male  27.0      0  13.0000
887       1  female  19.0      0  30.0000
888       3  female   NaN      1  23.4500
889       1    male  26.0      0  30.0000
890       3    male  32.0      0   7.7500

[891 rows x 5 columns]

In [274]:
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler
from sklearn.preprocessing import minmax_scale
from sklearn.preprocessing import robust_scale

In [275]:
X = data
y = df['Survived']

In [276]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42)

In [277]:
X

     Pclass     Sex   Age  SibSp     Fare
0         3    male  22.0      1   7.2500
1         1  female  38.0      1  71.2833
2         3  female  26.0      0   7.9250
3         1  female  35.0      1  53.1000
4         3    male  35.0      0   8.0500
..      ...     ...   ...    ...      ...
886       2    male  27.0      0  13.0000
887       1  female  19.0      0  30.0000
888       3  female   NaN      1  23.4500
889       1    male  26.0      0  30.0000
890       3    male  32.0      0   7.7500

[891 rows x 5 columns]

In [278]:
scaler = StandardScaler()
X_train[['Fare']] = scaler.fit_transform(X_train[['Fare']])

In [279]:
X_train

     Pclass     Sex   Age  SibSp      Fare
331       1    male  45.5      0 -0.078684
733       2    male  23.0      0 -0.377145
382       3    male  32.0      0 -0.474867
704       3    male  26.0      1 -0.476230
813       3  female   6.0      4 -0.025249
..      ...     ...   ...    ...       ...
106       3  female  21.0      0 -0.480162
270       1    male   NaN      0 -0.030545
860       3    male  41.0      2 -0.355804
435       1  female  14.0      1  1.683201
102       1    male  21.0      0  0.860748

[712 rows x 5 columns]

In [280]:
# X_train[['fair']] = minmax_scale(X_train[['Fare']])

In [281]:
# X_train

In [282]:
# X_train[['Fair']]=robust_scale(X_train[['Fare']])

In [283]:
# X_train

In [284]:
from sklearn.preprocessing import OneHotEncoder

In [285]:
X_train

     Pclass     Sex   Age  SibSp      Fare
331       1    male  45.5      0 -0.078684
733       2    male  23.0      0 -0.377145
382       3    male  32.0      0 -0.474867
704       3    male  26.0      1 -0.476230
813       3  female   6.0      4 -0.025249
..      ...     ...   ...    ...       ...
106       3  female  21.0      0 -0.480162
270       1    male   NaN      0 -0.030545
860       3    male  41.0      2 -0.355804
435       1  female  14.0      1  1.683201
102       1    male  21.0      0  0.860748

[712 rows x 5 columns]

In [286]:
X_train.mode()

   Pclass   Sex   Age  SibSp     Fare
0       3  male  24.0      0 -0.47246

In [287]:
age_mode = X_train['Age'].mode()[0]
X_train_new = X_train[['Age']].fillna(age_mode)

In [288]:
X_train_new

      Age
331  45.5
733  23.0
382  32.0
704  26.0
813   6.0
..    ...
106  21.0
270  24.0
860  41.0
435  14.0
102  21.0

[712 rows x 1 columns]

In [289]:
from sklearn.preprocessing import OneHotEncoder

In [290]:
X_train['Sex']= X_train['Sex'].map({'male': 0, 'female': 1})

In [ ]:
X_train_new